app/controllers/messages_controller.rb

  def index
    @messages = Message.all
---
SELECT "messages".* FROM "messages"

  def create
    @user = User.find(params[:user_id])

   @message = @user.messages.create(message_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "messages" ("doctor", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["doctor", "whoever"], ["description", "dum dum dum!"], ["user_id", 1], ["created_at", "2019-07-11 21:29:25.545922"], ["updated_at", "2019-07-11 21:29:25.545922"]]