app/controllers/prescriptions_controller.rb

  def index
     @prescriptions = User.find(params[:user_id]).prescriptions
---
SELECT "prescriptions".* FROM "prescriptions" WHERE "prescriptions"."user_id" = $1  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show
    @user = User.find(params[:user_id])
    @prescriptions= @user.prescriptions
    @prescription = @prescriptions.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "prescriptions".* FROM "prescriptions" WHERE "prescriptions"."user_id" = $1 AND "prescriptions"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 4], ["LIMIT", 1]]

  def create
   @user = User.find params[:user_id]
   @user.prescriptions << Prescription.new(prescription_params)

   render json:{
     prescription: @user.prescriptions.last
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "prescriptions" ("name", "dosage", "medication_time", "purpose", "pharmacy", "prescriber", "prescriber_specialization", "prescriber_phone", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
SELECT  "prescriptions".* FROM "prescriptions" WHERE "prescriptions"."user_id" = $1 ORDER BY "prescriptions"."id" DESC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]

  def update
    @user = User.find params[:user_id]
  @prescription = @user.prescriptions.where(id: params[:id])
    if @prescription.update(prescription_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "prescriptions".* FROM "prescriptions" WHERE "prescriptions"."user_id" = $1 AND "prescriptions"."id" = $2  [["user_id", 1], ["id", 9]]
UPDATE "prescriptions" SET "name" = $1, "medication_time" = $2, "purpose" = $3, "prescriber" = $4, "prescriber_specialization" = $5, "updated_at" = $6 WHERE "prescriptions"."id" = $7  [["name", "Tylenol"], ["medication_time", ""], ["purpose", ""], ["prescriber", "Dr. M"], ["prescriber_specialization", ""], ["updated_at", "2019-07-15 14:57:43.159158"], ["id", 12]]

  def destroy
    @user = User.find params[:user_id]
    @prescription = @user.prescriptions.where(id: params[:id])
    @prescription[0].destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "prescriptions".* FROM "prescriptions" WHERE "prescriptions"."user_id" = $1 AND "prescriptions"."id" = $2  [["user_id", 1], ["id", 7]]
DELETE FROM "prescriptions" WHERE "prescriptions"."id" = $1  [["id", 7]]

    def set_prescription
      @prescription = Prescription.find(params[:id])
---
SELECT  "prescriptions".* FROM "prescriptions" WHERE "prescriptions"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]