goodrx-app/app/controllers/application_controller.rb

    def handle_login username, password
        @user = User.find_by_username(username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "captain@fakemail.com"], ["LIMIT", 1]]