goodrx-app/app/controllers/doctors_controller.rb

  def index
    @doctors = Doctor.all
---
SELECT "doctors".* FROM "doctors"

    def set_doctor
      @doctor = Doctor.find(params[:id])
---
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]