goodrx-app/app/controllers/prescriptions_controller.rb

SELECT "prescriptions".* FROM "prescriptions" WHERE "prescriptions"."user_id" = $1  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @prescriptions = User.find(params[:user_id]).prescriptions