goodrx-app/app/controllers/prescriptions_controller.rb

  def index
    @prescriptions = Prescription.all
---
SELECT "prescriptions".* FROM "prescriptions"