goodrx-app/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "phone_number", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    @user.password = params[:password]
    if @user.save